Repository: harryneufeld/FileTextSearch
Catalog: SimpleFullTextSearcher/Loc/*/LC_Messages/sfts.po
Languages: ru_ru

source: Should be valid FileStream!
ru_ru: Необходимо представить валидный FileStream!

source: The FileStream does not support read operation!
ru_ru: Представленный FileStream не поддерживает операцию чтения!

source: The FileStream does not support search operation!
ru_ru: Представленный FileStream не поддерживает операцию поиска!

source: Should be valid BOM bytes array!
ru_ru: Необходимо представить валидный BOM массив байтов!

source: The string
ru_ru: Строка

source: cannot be converted to an array of bytes.
ru_ru: не может быть конвертирована в массив байтов.

source: Search string cannot be empty.
ru_ru: Строка поиска не может быть пустой.

source: The directory
ru_ru: Каталог

source: not available.
ru_ru: недоступен.

source: Ready to the first start
ru_ru: Готов к первому запуску

source: Search criteria
ru_ru: Критерии поиска

source: Search in image files (OCR)
ru_ru: Поиск в файлах изображений (OCR)

source: Search in zip-archives
ru_ru: Искать в zip-архивах

source: Searched text:
ru_ru: Критерии поиска:

source: File-name pattern:
ru_ru: Шаблон имени файла:

source: Starting search directory:
ru_ru: Начальная директория поиска:

source: Search:
ru_ru: Поиск:

source: Start
ru_ru: Старт

source: Pause
ru_ru: Пауза

source: Stop
ru_ru: Стоп

source: Search results
ru_ru: Результаты поиска

source: About
ru_ru: О программе

source: Language
ru_ru: Язык

source: Failed to save search criteria to file
ru_ru: Не удалось сохранить критерии поиска в файл

source: An error has occurred:
ru_ru: Произошла ошибка:

source: Saving search criteria
ru_ru: Сохранение критериев поиска

source: Failed to load search criteria from file
ru_ru: Не удалось загрузить критерии поиска из файла

source: Loading search criteria
ru_ru: Загрузка критериев поиска

source: Found matching in the file:
ru_ru: Найдено совпадение в файле:

source: Viewed Files
ru_ru: Просмотрено файлов

source: Search in:
ru_ru: Проверяется в:

source: Total matches found
ru_ru: Всего найдено совпадений

source: Elapsed time:
ru_ru: Затраченное время:

source: An error occurred during the search:
ru_ru: Во время поиска произошла ошибка:

source: Searching error
ru_ru: Ошибка поиска

source: Select the initial search directory
ru_ru: Выберите начальную директорию поиска

source: Search is already running. Stop the search or wait for the process to complete.
ru_ru: Поиск уже запущен. Остановите поиск или дождитесь окончания процесса.

source: Start searching
ru_ru: Запуск поиска

source: Continue
ru_ru: Продолжить

source: The program is designed for full-text search in files with specified search criteria.
ru_ru: Программа предназначена для полнотекстового поиска в файлах с заданными критериями поиска.

source: Author: unchase (https://github.com/unchase), august 2018.
ru_ru: Автор: unchase (https://github.com/unchase), август 2018 г.

source: The search initial directory is not selected or does not exist!
ru_ru: Начальная директория поиска не выбрана или не существует!

source: Select it and run the search again.
ru_ru: Выберите ее и запустите поиск снова.

source: Input Validation
ru_ru: Провека входных данных

source: The file name template should not be empty.
ru_ru: Шаблон имени файла не должен быть пуст.

source: The text to be searched should not be empty.
ru_ru: Искомый текст не должен быть пуст.
